IDEA Open Model
TypeOfCombiEC Enumeration
Compatible with IDEA StatiCa 20.1
 Type of combination
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum TypeOfCombiEC
Public Enumeration TypeOfCombiEC
Members
Member name | Value | Description
ULS | 0 |  combination
Accidental | 2 |  accidental combination 1
SLS_Char | 5 |  characteristic combination
SLS_Freq | 6 |  frequent combination
SLS_Quasi | 7 |  quasi combination
Fatigue | 8 |  Fatigue combination
See Also
Reference
IdeaRS.OpenModel.Loading Namespace